Revit 2027 API
Transform2D Constructor
Overload List
Name | Description
Transform2D(Transform2D) |  The copy constructor.
Transform2D(UV, UV, UV) |  Constructs the transformation by specifying the vectors and the origin.
Top
See Also
Reference
Transform2D Class
Autodesk.Revit.DB Namespace